package cross;

/**
 * 对实测数据进行无量纲标准化处理
 */
public class Standardization {
    // x数组存储实测数据的9项指标，依次为：
    // 电压偏差，暂态压降，三相不平衡，电压波动，电压闪变，电压谐波，频率偏差，供电可靠性，服务性指标
    public static double[] getG(double[] x) {
        double[] g = new double[9];
        g[0] = (x[0] - 7.0) / (0.0 - 7.0);
        g[1] = (x[1] - 0.1) / (1 - 0.1);
        g[2] = (x[2] - 2.0) / (0.0 - 2.0);
        g[3] = (x[3] - 2.0) / (0.0 - 2.0);
        g[4] = (x[4] - 1.0) / (0.0 - 1.0);
        g[5] = (x[5] - 5.0) / (0.0 - 5.0);
        g[6] = (x[6] - 0.2) / (0.0 - 0.2);
        g[7] = (x[7] - 0.7) / (1.0 - 0.7);
        g[8] = (x[8] - 0.6) / (1.0 - 0.6);
        return g;
    }
}
